wrk/sharding_res/wrk_get.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
Running 30s test @ http://127.0.0.1:8080
  6 threads and 1024 connections
  Thread calibration: mean lat.: 1.102ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.097ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.906ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.057ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.081ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.941ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   779.25us  371.99us  12.22ms   75.28%
    Req/Sec   668.82    347.96     1.55k    63.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  765.00us
 75.000%    1.03ms
 90.000%    1.17ms
 99.000%    1.44ms
 99.900%    4.21ms
 99.990%    7.45ms
 99.999%    9.99ms
100.000%   12.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.153     0.000000            1         1.00
       0.347     0.100000         7307         1.11
       0.465     0.200000        14592         1.25
       0.561     0.300000        21893         1.43
       0.667     0.400000        29217         1.67
       0.765     0.500000        36438         2.00
       0.824     0.550000        40106         2.22
       0.866     0.600000        43720         2.50
       0.906     0.650000        47380         2.86
       0.967     0.700000        51016         3.33
       1.030     0.750000        54628         4.00
       1.053     0.775000        56534         4.44
       1.072     0.800000        58362         5.00
       1.089     0.825000        60157         5.71
       1.109     0.850000        61969         6.67
       1.134     0.875000        63761         8.00
       1.150     0.887500        64665         8.89
       1.169     0.900000        65573        10.00
       1.191     0.912500        66485        11.43
       1.215     0.925000        67390        13.33
       1.240     0.937500        68289        16.00
       1.252     0.943750        68750        17.78
       1.265     0.950000        69189        20.00
       1.278     0.956250        69671        22.86
       1.290     0.962500        70117        26.67
       1.304     0.968750        70556        32.00
       1.314     0.971875        70808        35.56
       1.325     0.975000        71023        40.00
       1.336     0.978125        71250        45.71
       1.349     0.981250        71470        53.33
       1.364     0.984375        71704        64.00
       1.374     0.985938        71806        71.11
       1.394     0.987500        71922        80.00
       1.416     0.989062        72031        91.43
       1.475     0.990625        72145       106.67
       1.630     0.992188        72259       128.00
       1.762     0.992969        72315       142.22
       1.874     0.993750        72372       160.00
       2.015     0.994531        72429       182.86
       2.193     0.995313        72486       213.33
       2.401     0.996094        72543       256.00
       2.509     0.996484        72571       284.44
       2.655     0.996875        72600       320.00
       2.783     0.997266        72628       365.71
       2.905     0.997656        72658       426.67
       3.185     0.998047        72685       512.00
       3.301     0.998242        72699       568.89
       3.487     0.998437        72714       640.00
       3.761     0.998633        72728       731.43
       3.939     0.998828        72742       853.33
       4.227     0.999023        72756      1024.00
       4.343     0.999121        72763      1137.78
       4.643     0.999219        72771      1280.00
       4.871     0.999316        72778      1462.86
       5.139     0.999414        72785      1706.67
       5.335     0.999512        72793      2048.00
       5.451     0.999561        72795      2275.56
       5.527     0.999609        72799      2560.00
       5.815     0.999658        72803      2925.71
       5.963     0.999707        72806      3413.33
       6.467     0.999756        72810      4096.00
       6.671     0.999780        72811      4551.11
       6.791     0.999805        72813      5120.00
       6.883     0.999829        72815      5851.43
       7.051     0.999854        72817      6826.67
       7.375     0.999878        72819      8192.00
       7.375     0.999890        72819      9102.22
       7.451     0.999902        72820     10240.00
       7.559     0.999915        72821     11702.86
       8.495     0.999927        72822     13653.33
       8.503     0.999939        72823     16384.00
       8.503     0.999945        72823     18204.44
       8.639     0.999951        72824     20480.00
       8.639     0.999957        72824     23405.71
       8.703     0.999963        72825     27306.67
       8.703     0.999969        72825     32768.00
       8.703     0.999973        72825     36408.89
       9.991     0.999976        72826     40960.00
       9.991     0.999979        72826     46811.43
       9.991     0.999982        72826     54613.33
       9.991     0.999985        72826     65536.00
       9.991     0.999986        72826     72817.78
      12.231     0.999988        72827     81920.00
      12.231     1.000000        72827          inf
#[Mean    =        0.779, StdDeviation   =        0.372]
#[Max     =       12.224, Total count    =        72827]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  164155 requests in 30.00s, 12.93MB read
  Socket errors: connect 5, read 0, write 0, timeout 13250
  Non-2xx or 3xx responses: 987
Requests/sec:   5471.79
Transfer/sec:    441.38KB