wrk/sharding_res/wrk_put.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
Running 30s test @ http://127.0.0.1:8080
  6 threads and 1024 connections
  Thread calibration: mean lat.: 0.988ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.006ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.965ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.136ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.895ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.897ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.86ms    1.13ms  39.33ms   99.01%
    Req/Sec   608.50    284.38     2.78k    69.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  788.00us
 75.000%    1.05ms
 90.000%    1.19ms
 99.000%    1.96ms
 99.900%   18.58ms
 99.990%   36.32ms
 99.999%   39.20ms
100.000%   39.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.175     0.000000            1         1.00
       0.368     0.100000         6655         1.11
       0.486     0.200000        13287         1.25
       0.585     0.300000        19903         1.43
       0.689     0.400000        26546         1.67
       0.788     0.500000        33144         2.00
       0.850     0.550000        36443         2.22
       0.893     0.600000        39850         2.50
       0.933     0.650000        43103         2.86
       0.994     0.700000        46381         3.33
       1.054     0.750000        49754         4.00
       1.074     0.775000        51369         4.44
       1.092     0.800000        53047         5.00
       1.109     0.825000        54669         5.71
       1.129     0.850000        56322         6.67
       1.157     0.875000        57990         8.00
       1.173     0.887500        58805         8.89
       1.194     0.900000        59644        10.00
       1.218     0.912500        60480        11.43
       1.246     0.925000        61298        13.33
       1.270     0.937500        62138        16.00
       1.280     0.943750        62541        17.78
       1.292     0.950000        62958        20.00
       1.305     0.956250        63364        22.86
       1.320     0.962500        63782        26.67
       1.338     0.968750        64186        32.00
       1.349     0.971875        64403        35.56
       1.360     0.975000        64612        40.00
       1.373     0.978125        64807        45.71
       1.396     0.981250        65014        53.33
       1.436     0.984375        65221        64.00
       1.476     0.985938        65325        71.11
       1.565     0.987500        65429        80.00
       1.798     0.989062        65534        91.43
       2.155     0.990625        65636       106.67
       2.657     0.992188        65739       128.00
       2.995     0.992969        65791       142.22
       3.435     0.993750        65842       160.00
       4.049     0.994531        65894       182.86
       5.035     0.995313        65946       213.33
       6.563     0.996094        65998       256.00
       7.587     0.996484        66024       284.44
       8.687     0.996875        66049       320.00
       9.823     0.997266        66075       365.71
      10.919     0.997656        66101       426.67
      12.847     0.998047        66127       512.00
      13.487     0.998242        66140       568.89
      14.399     0.998437        66153       640.00
      15.535     0.998633        66166       731.43
      16.751     0.998828        66180       853.33
      19.135     0.999023        66192      1024.00
      20.751     0.999121        66199      1137.78
      22.351     0.999219        66205      1280.00
      25.039     0.999316        66211      1462.86
      26.799     0.999414        66218      1706.67
      28.431     0.999512        66224      2048.00
      29.135     0.999561        66227      2275.56
      30.511     0.999609        66231      2560.00
      31.567     0.999658        66234      2925.71
      31.903     0.999707        66237      3413.33
      32.607     0.999756        66240      4096.00
      33.247     0.999780        66242      4551.11
      34.815     0.999805        66244      5120.00
      35.295     0.999829        66245      5851.43
      36.095     0.999854        66248      6826.67
      36.095     0.999878        66248      8192.00
      36.319     0.999890        66250      9102.22
      36.319     0.999902        66250     10240.00
      37.119     0.999915        66251     11702.86
      38.015     0.999927        66252     13653.33
      38.015     0.999939        66252     16384.00
      38.207     0.999945        66253     18204.44
      38.207     0.999951        66253     20480.00
      39.039     0.999957        66254     23405.71
      39.039     0.999963        66254     27306.67
      39.039     0.999969        66254     32768.00
      39.199     0.999973        66255     36408.89
      39.199     0.999976        66255     40960.00
      39.199     0.999979        66255     46811.43
      39.199     0.999982        66255     54613.33
      39.199     0.999985        66255     65536.00
      39.359     0.999986        66256     72817.78
      39.359     1.000000        66256          inf
#[Mean    =        0.860, StdDeviation   =        1.133]
#[Max     =       39.328, Total count    =        66256]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  137665 requests in 30.00s, 10.89MB read
  Socket errors: connect 5, read 0, write 0, timeout 13323
  Non-2xx or 3xx responses: 94
Requests/sec:   4588.81
Transfer/sec:    371.79KB